# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+startup: overview indent auto-fill
#+export_file_name: ./html/index.html
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup

#+title: Quantum Mechanics and Quantum Information: a Pythonic Introduction
#+author: Dr. E.P. Blair



* Direnv Setup and Python Environment                              :noexport:

** A Sample =.envrc= File

This file may be tangled using =C-u C-c C-v t=:
#+begin_src bash :padline none :tangle "./.envrc"
# Activate Python virtual environment
#   If it doesn't exist, this createa virtual env
#   in ./.direnv/python-3.11/
layout python

# Specify Python version if required (optional)
# layout python <python_version>

# Automatically add project's src folder to PYTHONPATH
# This may not be neccessary
export PYTHONPATH=$PWD/src:$PYTHONPATH

# Load environment variables from a .env file, if it exists
if [[ -f .env ]]; then
  dotenv
fi

# Additional Zsh-specific configurations (if any)
# Example: Zsh-specific exports or aliases
export ZSH_ENV_VAR="SomeValue"

#+end_src



#+begin_src emacs-lisp :eval never
(setq-local org-babel-python-command "/path/to/envname/bin/python3")
#+end_src


* Contents

** Python

[[./PythonSetup.html][Python Setup]]

[[./PythonBasics.html][Basic Python Programming]]

[[./PythonIntermediateSkills.html][Intermediate Python Programming]]

** Quantum Information and Quantum Mechanics

[[./ClassicalInfoQuantumInfo.html][Classical Information and Quantum Information]]

** Appendix

[[./AppendixQiskitIBMSimRun.html][Qiskit + IBM Simulations and Calculations]]

[[./AppendixExBellCircuits.html][Qiskit + IBM Example: Bell Circuits]]


* GitHub                                                           :noexport:

#+begin_src zsh :results output
  source ~/.zshrc

  cd ..
  ls docs/img/dbl_potiential_well.png  
  git add docs/img/dbl_potiential_well.png
  git commit -m "Adds a double-well image (asymmetric)"
  git pull
  git push  
#+end_src

#+RESULTS:
: docs/img/dbl_potiential_well.png
: [main 06ad51a] Adds a double-well image (asymmetric)
:  1 file changed, 0 insertions(+), 0 deletions(-)
:  create mode 100644 docs/img/dbl_potiential_well.png
: Merge made by the 'ort' strategy.
:  docs/img/driven-N-cell-system.png | Bin 0 -> 69624 bytes
:  1 file changed, 0 insertions(+), 0 deletions(-)
:  create mode 100644 docs/img/driven-N-cell-system.png
